#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Tue Nov 14 10:01:04 2023

add_design "D:/pango_projection/ziguang/source/AXI-interconnecter/AXI_Arbiter_W.v"
add_design "D:/pango_projection/ziguang/source/AXI-interconnecter/AXI_Interconnect.v"
add_design "D:/pango_projection/ziguang/source/AXI-interconnecter/AXI_Master_Mux_W.v"
add_design "D:/pango_projection/ziguang/source/canny/canny/canny_doubleThreshold.v"
add_design "D:/pango_projection/ziguang/source/canny/canny/canny_edge_detect_top.v"
add_design "D:/pango_projection/ziguang/source/canny/canny/canny_get_grandient.v"
add_design "D:/pango_projection/ziguang/source/canny/canny/canny_nonLocalMaxValue.v"
add_design "D:/pango_projection/ziguang/source/canny/canny/canny_top.v"
add_design "D:/pango_projection/ziguang/source/canny/canny/cordic_pipline.v"
add_design "D:/pango_projection/ziguang/source/canny/canny/cordic_sqrt.v"
add_design "D:/pango_projection/ziguang/source/canny/canny/fifo_ram.v"
add_design "D:/pango_projection/ziguang/source/canny/canny/image_gaussian_filter.v"
add_design "D:/pango_projection/ziguang/source/canny/canny/matrix_generate_3x3.v"
add_design "D:/pango_projection/ziguang/source/canny/canny/one_column_ram.v"
add_design "D:/pango_projection/ziguang/source/canny/canny/VIP_RGB888_YCbCr444.v"
add_design "D:/pango_projection/ziguang/source/eth/pattern_vg.v"
add_design "D:/pango_projection/ziguang/source/eth/udp/udp.v"
add_design "D:/pango_projection/ziguang/source/eth/udp/udp_rx.v"
add_design "D:/pango_projection/ziguang/source/eth/udp/udp_tx.v"
add_design "D:/pango_projection/ziguang/source/eth/sources/eth_ctrl.v"
add_design "D:/pango_projection/ziguang/source/eth/sources/eth_udp_loop.v"
add_design "D:/pango_projection/ziguang/source/eth/gmii_to_rgmii/gmii_to_rgmii.v"
add_design "D:/pango_projection/ziguang/source/eth/gmii_to_rgmii/rgmii_rx.v"
add_design "D:/pango_projection/ziguang/source/eth/gmii_to_rgmii/rgmii_tx.v"
add_design "D:/pango_projection/ziguang/source/eth/arp/arp.v"
add_design "D:/pango_projection/ziguang/source/eth/arp/arp_rx.v"
add_design "D:/pango_projection/ziguang/source/eth/arp/arp_tx.v"
add_design "D:/pango_projection/ziguang/source/eth/arp/crc32_d8.v"
add_design "D:/pango_projection/ziguang/source/jichuang_project/vtc.v"
add_design "D:/pango_projection/ziguang/source/liangdu/constrast_ipcore.v"
add_design "D:/pango_projection/ziguang/source/liangdu/Contrast_Prj.v"
add_design "D:/pango_projection/ziguang/source/liangdu/Key_Module.v"
add_design "D:/pango_projection/ziguang/source/liangdu/photoshop.v"
add_design "D:/pango_projection/ziguang/source/liangdu/Reciprocal.v"
add_design "D:/pango_projection/ziguang/source/MS72xx/iic_dri.v"
add_design "D:/pango_projection/ziguang/source/MS72xx/ms72xx_ctl.v"
add_design "D:/pango_projection/ziguang/source/MS72xx/ms7200_ctl.v"
add_design "D:/pango_projection/ziguang/source/MS72xx/ms7210_ctl.v"
add_design "D:/pango_projection/ziguang/source/ov5640/cmos_capture_data.v"
add_design "D:/pango_projection/ziguang/source/ov5640/i2c_dri.v"
add_design "D:/pango_projection/ziguang/source/ov5640/i2c_ov5640_rgb565_cfg.v"
add_design "D:/pango_projection/ziguang/source/ov5640/ov5640_dri.v"
add_design "D:/pango_projection/ziguang/source/sources/eth_ctrl.v"
add_design "D:/pango_projection/ziguang/source/sources/eth_udp_loop.v"
add_design "D:/pango_projection/ziguang/source/video_scale/video_scale_640_480.v"
add_design "D:/pango_projection/ziguang/source/video_scale/video_scale_960_540.v"
add_design "D:/pango_projection/ziguang/source/video_stream_dma/fs_cap.v"
add_design "D:/pango_projection/ziguang/source/video_stream_dma/vsbuf.v"
add_design "D:/pango_projection/ziguang/source/video_stream_dma/VSDMA.v"
add_design "D:/pango_projection/ziguang/source/video_stream_dma/vsdma_control.v"
add_design "D:/pango_projection/ziguang/source/video_stream_dma/vsdma_to_axi.v"
add_design "D:/pango_projection/ziguang/source/rgb_to_ycbcr.v"
add_design "D:/pango_projection/ziguang/source/xiaodou.v"
add_design "D:/pango_projection/ziguang/source/jichuang_project/top.v"
add_design "D:/pango_projection/ziguang/ipcore/async_fifo_1024x32b/async_fifo_1024x32b.idf"
add_design "D:/pango_projection/ziguang/ipcore/ddr3_ip/ddr3_ip.idf"
add_design "D:/pango_projection/ziguang/ipcore/fifo_shift/fifo_shift.idf"
add_design "D:/pango_projection/ziguang/ipcore/fifoin/fifoin.idf"
add_design "D:/pango_projection/ziguang/ipcore/fifoout/fifoout.idf"
add_design "D:/pango_projection/ziguang/ipcore/pll/pll.idf"
add_design "D:/pango_projection/ziguang/ipcore/pll_clk/pll_clk.idf"
add_design "D:/pango_projection/ziguang/ipcore/pll_sft/pll_sft.idf"
add_design "D:/pango_projection/ziguang/ipcore/ram_32to256/ram_32to256.idf"
add_design "D:/pango_projection/ziguang/ipcore/shift/shift.idf"
add_design "D:/pango_projection/ziguang/ipcore/sync_fifo_2048x32b/sync_fifo_2048x32b.idf"
add_constraint "D:/pango_projection/ziguang/source/top.fdc"
remove_design -verilog "D:/pango_projection/ziguang/source/eth/sources/eth_ctrl.v"
remove_design -verilog "D:/pango_projection/ziguang/source/eth/sources/eth_udp_loop.v"
remove_design D:/pango_projection/ziguang/ipcore/async_fifo_1024x32b/async_fifo_1024x32b.idf
remove_design D:/pango_projection/ziguang/ipcore/shift/shift.idf
remove_design D:/pango_projection/ziguang/ipcore/pll/pll.idf
remove_design D:/pango_projection/ziguang/ipcore/fifo_shift/fifo_shift.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
report_power 
gen_netlist 
add_design "D:/pango_projection/ziguang/source/top/top.v"
add_design "D:/pango_projection/ziguang/source/top/vtc.v"
add_design "D:/pango_projection/ziguang/source/canny/canny_doubleThreshold.v"
add_design "D:/pango_projection/ziguang/source/canny/canny_edge_detect_top.v"
add_design "D:/pango_projection/ziguang/source/canny/canny_get_grandient.v"
add_design "D:/pango_projection/ziguang/source/canny/canny_nonLocalMaxValue.v"
add_design "D:/pango_projection/ziguang/source/canny/canny_top.v"
add_design "D:/pango_projection/ziguang/source/canny/cordic_pipline.v"
add_design "D:/pango_projection/ziguang/source/canny/cordic_sqrt.v"
add_design "D:/pango_projection/ziguang/source/canny/fifo_ram.v"
add_design "D:/pango_projection/ziguang/source/canny/image_gaussian_filter.v"
add_design "D:/pango_projection/ziguang/source/canny/matrix_generate_3x3.v"
add_design "D:/pango_projection/ziguang/source/canny/one_column_ram.v"
add_design "D:/pango_projection/ziguang/source/canny/VIP_RGB888_YCbCr444.v"
add_design "D:/pango_projection/ziguang/source/scale/video_scale_640_480.v"
add_design "D:/pango_projection/ziguang/source/scale/video_scale_960_540.v"
remove_design -force -verilog "D:/pango_projection/ziguang/source/canny/canny/canny_doubleThreshold.v"
remove_design -force -verilog "D:/pango_projection/ziguang/source/canny/canny/canny_edge_detect_top.v"
remove_design -force -verilog "D:/pango_projection/ziguang/source/canny/canny/canny_get_grandient.v"
remove_design -force -verilog "D:/pango_projection/ziguang/source/canny/canny/canny_nonLocalMaxValue.v"
remove_design -force -verilog "D:/pango_projection/ziguang/source/canny/canny/canny_top.v"
remove_design -force -verilog "D:/pango_projection/ziguang/source/canny/canny/cordic_pipline.v"
remove_design -force -verilog "D:/pango_projection/ziguang/source/canny/canny/cordic_sqrt.v"
remove_design -force -verilog "D:/pango_projection/ziguang/source/canny/canny/fifo_ram.v"
remove_design -force -verilog "D:/pango_projection/ziguang/source/canny/canny/image_gaussian_filter.v"
remove_design -force -verilog "D:/pango_projection/ziguang/source/canny/canny/matrix_generate_3x3.v"
remove_design -force -verilog "D:/pango_projection/ziguang/source/canny/canny/one_column_ram.v"
remove_design -force -verilog "D:/pango_projection/ziguang/source/canny/canny/VIP_RGB888_YCbCr444.v"
remove_design -force -verilog "D:/pango_projection/ziguang/source/jichuang_project/vtc.v"
remove_design -force -verilog "D:/pango_projection/ziguang/source/video_scale/video_scale_640_480.v"
remove_design -force -verilog "D:/pango_projection/ziguang/source/video_scale/video_scale_960_540.v"
remove_design -force -verilog "D:/pango_projection/ziguang/source/jichuang_project/top.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
report_power 
gen_netlist 
remove_design -force -verilog "D:/pango_projection/ziguang/source/scale/video_scale_640_480.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
report_power 
gen_netlist 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
report_power 
gen_netlist 
add_design "D:/pango_projection/ziguang/source/key/xiaodou.v"
add_design "D:/pango_projection/ziguang/source/scale/suofang_scale.v"
add_design "D:/pango_projection/ziguang/source/eth/eth/eth_ctrl.v"
add_design "D:/pango_projection/ziguang/source/eth/eth/eth_udp_loop.v"
add_design "D:/pango_projection/ziguang/source/huidu/rgb_to_ycbcr.v"
remove_design -verilog "D:/pango_projection/ziguang/source/sources/eth_ctrl.v"
remove_design -verilog "D:/pango_projection/ziguang/source/sources/eth_udp_loop.v"
remove_design -verilog "D:/pango_projection/ziguang/source/rgb_to_ycbcr.v"
remove_design -verilog "D:/pango_projection/ziguang/source/xiaodou.v"
remove_design -verilog "D:/pango_projection/ziguang/source/scale/video_scale_960_540.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
report_power 
gen_netlist 
